blog/book-review-ppp-by-bjarne-stroustrup.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <!-- 2021-07-13 Tue 18:13 -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Book review: "Programming Principles And Practice Using C++" (by Bjarne Stroustrup)</title>
    <meta name="generator" content="Org mode">
    <meta name="author" content="Utkarsh Singh">
    <link rel='stylesheet' type='text/css' href='../style.css'>
  </head>
  <body>
    <header>
      <nav>
	<div class="nav-left">
	  <ul>
	    <li><a href="../index.html">utkarshsingh.xyz</a></li>
	  </ul>
	</div>
	<div class="nav-right">
	  <ul>
	    <li><a href="../about">About</a></li>
	    <li><a href="../contact">Contact</a></li>
	    <li><a href="../blog">Blog</a></li>
	  </ul>
	</div>
      </nav>
    </header>
    <div id="content">
      <h1 class="title">Book review: "Programming Principles And Practice Using C++" (by Bjarne Stroustrup)</h1>

      <div id="outline-container-orgbd7afc6" class="outline-2">
	<h2 id="orgbd7afc6">Introduction</h2>
	<div class="outline-text-2" id="text-orgbd7afc6">
	  <p>
	    Bjarne Stroustrup is well know for his work on C++ and OO programming.
	    PPP (this book) works as a introductory material for learning
	    practical programming skills using C++.  After learning C (first year
	    programming course) and Python (second year programming course) I
	    badly wanted a language which focuses on performance and utility and
	    C++ surely seals the deal.
	  </p>
	</div>
      </div>

      <div id="outline-container-orged7f570" class="outline-2">
	<h2 id="orged7f570">Review</h2>
	<div class="outline-text-2" id="text-orged7f570">
	  <p>
	    PPP starts with a overview of C++ which was indeed simple and concise
	    but the fun part really begins with Chapter 6 "Writing A Program"
	    where authors takes a programming project of implementing a
	    calculator.
	  </p>

	  <p>
	    But the author didn't stop here, he questions the quality of code and
	    takes on the task to improve it.  Then author takes on the task to
	    explain the concepts of OO programming following with the "display
	    model" GUI library (FLTK based) by going through the example of a
	    Graph application.
	  </p>

	  <p>
	    Then the book touches on the topic of history of programming
	    languages, testing and The C Programming language which helps to
	    understand the incompatibility's in C/C++ programs.
	  </p>

	  <p>
	    As summarised above the book tries to give details of all major
	    programming concepts and hence leads to a very comprehensive material.
	  </p>
	</div>
      </div>

      <div id="outline-container-org2d21620" class="outline-2">
	<h2 id="org2d21620">Conclusion</h2>
	<div class="outline-text-2" id="text-org2d21620">
	  <p>
	    This book is highly recommend for a beginner C++ programmer because
	    unlike C, C++ is a much bigger language and it will definitely help to
	    decrease the gap between beginner/expert C++ programmer.
	  </p>
	</div>
      </div>
    </div>
    <footer>
      Copyright(c)2021 Utkarsh Singh.  All original content is
      licensed under free/libre copyleft license(GPL or CC BY-SA).
    </footer>
  </body>
</html>
